{
  "intro": {
    "hello": "Ciao",
    "i_am": "Sono",
    "description": "Curo interfacce moderne, responsive e intuitive, combinando design, accessibilità e tecnologie web avanzate.",
    "talk": "Parliamo!"
  },

  "about_me": "Originario di Calvisano (Brescia), ho oltre 7 anni di esperienza nel settore retail, di cui 5 come store manager e 2 in ambito commerciale, sviluppando competenze in leadership, gestione del cliente B2B/B2C e organizzazione. Nel 2023 ho deciso di dedicarmi al web development, completando un corso per front-end developer presso la 24Ore Business School, con competenze in HTML, CSS, JavaScript, TypeScript, Angular e Ionic. Ora risiedo in provincia di Monza, pronto ad affrontare nuove sfide nel campo dello sviluppo web.",

  "experience": {
    "moi_2024": "Ho contribuito allo sviluppo di un’applicazione web migliorandone logica e interfaccia utente. Ho progettato una nuova interfaccia per la gestione dei DDT, integrato API del back end, implementato l’SDK Dynamsoft per la scansione documenti e utilizzato AG Grid per tabelle dinamiche. Il lavoro si è svolto in ambiente Docker.",
    "more_sales": "Mi sono occupato della ricerca di nuovi clienti, del mantenimento delle relazioni con quelli esistenti e della preparazione e aggiornamento dei listini di vendita. Ho lavorato per raggiungere obiettivi di vendita e supportato le attività di back office.",
    "more_store_manager": "Responsabile della gestione e apertura di due punti vendita MoreCover presso La Rinascente di Milano e Roma. Ho supervisionato due team di 4 persone, occupandomi di reclutamento, selezione, formazione e orientamento del personale. Ho lavorato per il raggiungimento dei KPI di vendita e curato la manutenzione delle stampanti UV."
  },

  "projects": {
    "moneychanger_description": "Moneychanger è un'app web che ti permette di convertire tra diverse valute. È un'applicazione web responsive costruita con Angular, in un ambiente Docker.",
    "money-tracker": {
      "description": "Money Tracker è un’applicazione mobile progettata per aiutarti a gestire le tue finanze in modo semplice ed efficace. Il progetto è nato dalla mia esigenza personale di organizzare meglio le spese quotidiane, esigenza che mi ha portato prima a testare varie app già disponibili e successivamente a svilupparne una mia utilizzando le competenze da sviluppatore front-end in Angular.",
      "techs": "La tecnologia utilizzata per Money Tracker include il framework Ionic con Capacitor per lo sviluppo multipiattaforma e Chart.js per visualizzare i dati in grafici intuitivi e facili da comprendere.",
      "features": {
        "1": "Tracciamento delle spese: Puoi registrare le tue uscite e categorizzarle in modo ordinato, per avere sempre una panoramica chiara delle tue finanze.",
        "2": "Visualizzazione dei dati: Le spese sono rappresentate tramite grafici semplici e interattivi, per consentire un’analisi rapida e precisa.",
        "3": "Gestione dei gruppi famiglia: Grazie a un sistema di autenticazione con login, puoi creare gruppi condivisi per monitorare le spese familiari. Questa funzionalità include:"
      },
      "subfeatures": {
        "sub3.1": "Suddivisione delle spese tra i membri del gruppo.",
        "sub3.2": "Gestione di eventuali debiti tra i membri, con calcoli automatici per bilanciare i conti."
      },
      "money-tracker_end": "Lo scopo di Money Tracker è semplificare la gestione finanziaria sia individuale che condivisa, rendendola accessibile e visivamente comprensibile per tutti."
    }
  },
  "footer": {
    "title": "Disponibile per opportunità di lavoro freelance",
    "message": "Hai bisogno di aiuto col tuo progetto? Inviami un'email o contattami tramite il form!",
    "copy": "E-mail copiata!"
  },
  "form": {
    "invalid": "Il campo è obbligatorio",
    "invalid-email": "Inserisci un indirizzo email valido",
    "min": "Valore troppo basso",
    "privacy1": "Accetto termini e",
    "privacy2": " condizioni (GDPR)",
    "privacy3": " e di essere ricontattato da Lorenzo Baratti o da suoi assistenti."
  }
}
