{
  "intro": {
    "hello": "Ciao",
    "i_am": "Sono",
    "description": "Curo interfacce moderne, responsive e intuitive, combinando design, accessibilità e tecnologie web avanzate.",
    "talk": "Parliamo!"
  },

  "about_me": "Originario di Calvisano (Brescia), ho oltre 7 anni di esperienza nel settore retail, di cui 5 come store manager e 2 in ambito commerciale, sviluppando competenze in leadership, gestione del cliente B2B/B2C e organizzazione. Nel 2023 ho deciso di dedicarmi al web development, completando un corso per front-end developer presso la 24Ore Business School, con competenze in HTML, CSS, JavaScript, TypeScript, Angular e Ionic. Ora risiedo in provincia di Monza, pronto ad affrontare nuove sfide nel campo dello sviluppo web.",

  "experience": {
    "freelance": "Da ottobre 2024, lavoro come sviluppatore frontend freelance, specializzandomi in Angular e PWA. Mi dedico a creare interfacce moderne e performanti, ampliando le mie competenze anche in backend, hosting e deploy per offrire soluzioni complete ai miei clienti. Parallelamente, sviluppo applicazioni open source per sperimentare nuove tecnologie e contribuire alla community tech. Sto anche esplorando lo sviluppo mobile, con l’obiettivo di creare PWA. Se cerchi uno sviluppatore frontend appassionato e in continua crescita, contattami per collaborazioni o progetti innovativi!",
    "moi_2024": "Ho contribuito allo sviluppo di un’applicazione web migliorandone logica e interfaccia utente. Ho progettato una nuova interfaccia per la gestione dei DDT, integrato API del back end, implementato l’SDK Dynamsoft per la scansione documenti e utilizzato AG Grid per tabelle dinamiche. Il lavoro si è svolto in ambiente Docker.",
    "more_sales": "Mi sono occupato della ricerca di nuovi clienti, del mantenimento delle relazioni con quelli esistenti e della preparazione e aggiornamento dei listini di vendita. Ho lavorato per raggiungere obiettivi di vendita e supportato le attività di back office.",
    "more_store_manager": "Responsabile della gestione e apertura di due punti vendita MoreCover presso La Rinascente di Milano e Roma. Ho supervisionato due team di 4 persone, occupandomi di reclutamento, selezione, formazione e orientamento del personale. Ho lavorato per il raggiungimento dei KPI di vendita e curato la manutenzione delle stampanti UV."
  },

  "projects": {
    "money-changer": {
      "description": "Money Changer è un progetto su cui ho lavorato da marzo 2024 a ottobre 2024 presso Moi Studio. Si tratta della rielaborazione di una web app già esistente, con l’obiettivo di creare una nuova interfaccia utente, mentre il team backend ha lavorato sull’aggiornamento delle funzionalità interne. Parallelamente, è stata sviluppata un’app gemella per la gestione delle pratiche burocratiche.Money Changer è un progetto su cui ho lavorato da marzo 2024 a ottobre 2024 presso Moi Studio. Si tratta della rielaborazione di una web app già esistente, con l’obiettivo di creare una nuova interfaccia utente, mentre il team backend ha lavorato sull’aggiornamento delle funzionalità interne. Parallelamente, è stata sviluppata un’app gemella per la gestione delle pratiche burocratiche.",
      "new_interface": "Il mio contributo principale è stato progettare una nuova interfaccia utente per la gestione del ritiro di contanti. Usando Figma, ho sviluppato un design moderno e intuitivo che semplifica il flusso di lavoro per l’utente finale.",
      "techs": "AG Grid: Ho integrato tabelle altamente performanti e personalizzabili, progettate per soddisfare esigenze a livello industriale. Dynamic Web TWAIN SDK di Dynamsoft: Questo SDK basato su browser consente di sviluppare applicazioni robuste per la scansione di documenti su tutti i principali browser. È progettato per garantire velocità, sicurezza e scalabilità con poche righe di codice JavaScript. Il progetto è stato eseguito in un ambiente containerizzato tramite Docker, garantendo che tutte le componenti funzionassero in maniera ottimale. Per raggiungere questo scopo, ho imparato a utilizzare Docker Desktop.",
      "features": {
        "1": "Scansione rapida ed efficace dei documenti: L’app consente di scansionare documenti in modo semplice e sicuro, salvando i dati in un database solido e affidabile.",
        "2": "Gestione avanzata dei dati: Le tabelle personalizzabili permettono agli utenti con privilegi elevati di gestire e organizzare i dati con estrema precisione.",
        "3": "Gestione delle transazioni di cambio valuta: L’app offre un’esperienza user-friendly per gestire le transazioni in modo rapido ed efficace, garantendo la massima sicurezza per prevenire errori e proteggere i clienti."
      },
      "conclusion": "Il progetto è stato sviluppato in un contesto Agile, con una stretta collaborazione tra i team di sviluppo e design per garantire un prodotto finale funzionale e di alta qualità."
    },
    "money-tracker": {
      "description": "Money Tracker è un’applicazione mobile progettata per aiutarti a gestire le tue finanze in modo semplice ed efficace. Il progetto è nato dalla mia esigenza personale di organizzare meglio le spese quotidiane. Dopo aver testato e studiato diverse applicazioni già esistenti sul mercato, ho tratto ispirazione dalle loro funzionalità principali per creare un’app che rispondesse pienamente alle mie esigenze personali e che offrisse un’esperienza utente migliorata.",
      "techs": "La tecnologia utilizzata per Money Tracker include il framework Ionic con Capacitor per lo sviluppo multipiattaforma e Chart.js per visualizzare i dati in grafici intuitivi e facili da comprendere.",
      "features": {
        "1": "Tracciamento delle spese: Puoi registrare le tue uscite e categorizzarle in modo ordinato, per avere sempre una panoramica chiara delle tue finanze.",
        "2": "Visualizzazione dei dati: Le spese sono rappresentate tramite grafici semplici e interattivi, per consentire un’analisi rapida e precisa.",
        "3": "Gestione dei gruppi famiglia: Grazie a un sistema di autenticazione con login, puoi creare gruppi condivisi per monitorare le spese familiari. Questa funzionalità include:"
      },
      "subfeatures": {
        "sub3.1": "Suddivisione delle spese tra i membri del gruppo.",
        "sub3.2": "Gestione di eventuali debiti tra i membri, con calcoli automatici per bilanciare i conti."
      },
      "conclusion": "Lo scopo di Money Tracker è semplificare la gestione finanziaria sia individuale che condivisa, rendendola accessibile e visivamente comprensibile per tutti."
    },
    "tasks-manager": {
      "description": "Un componente Todo integrato nel mio portfolio personale, sviluppato con Angular 18 e NgRx per dimostrare competenze avanzate nella gestione dello stato. L'obiettivo era creare un'interfaccia moderna e reattiva che mostrasse l'integrazione fluida tra componenti UI e state management.",
      "new_interface": "Ho progettato un'interfaccia con design glassmorphism che si integra perfettamente con la palette del portfolio, focalizzata sull'usabilità mobile-first. L'animazione delle transizioni e il feedback visivo delle azioni sono stati ottimizzati per un'esperienza utente fluida.",
      "techs": "Angular 18: Sfruttando le ultime feature come i nuovi control flow. NgRx: Implementato con store, actions e reducer per una gestione scalabile dello stato. RxJS: Per la reattività e gestione degli osservabili. SCSS: Con variabili CSS per una perfetta integrazione con la palette esistente.",
      "features": {
        "1": "Architettura a stato centralizzato: Tutte le operazioni CRUD passano attraverso lo store NgRx, dimostrando best practice per applicazioni complesse.",
        "2": "Modifica in-line: Permette di modificare i testi delle task direttamente nel componente, con autosave su blur.",
        "3": "Filtri intelligenti: Implementati tramite selector memoizzati per massimizzare le performance.",
        "4": "Persistence layer: Facilmente estendibile per salvare lo stato in localStorage o backend."
      },
      "subfeatures": {
        "sub4.1": "Struttura modulare dell'store",
        "sub4.2": "Azioni tipizzate con payload",
        "sub4.3": "Reducer puri con gestione immutabile dello stato",
        "sub4.4": "Selector efficienti per derivare dati complessi"
      },
      "conclusion": "Questo componente dimostra come NgRx possa semplificare la gestione dello stato anche in progetti di medie dimensioni, offrendo strumenti potenti per il debug (Redux DevTools) e una base solida per future estensioni. L'integrazione con Angular 18 mostra l'approccio moderno al reactive programming."
    }
  },
  "footer": {
    "title": "Disponibile per opportunità di lavoro freelance",
    "message": "Hai bisogno di aiuto col tuo progetto? Inviami un'email o contattami tramite il form!",
    "copy": "E-mail copiata!"
  },
  "form": {
    "invalid": "Il campo è obbligatorio",
    "invalid-email": "Inserisci un indirizzo email valido",
    "min": "Valore troppo basso",
    "privacy1": "Accetto termini e",
    "privacy2": " condizioni (GDPR)",
    "privacy3": " e di essere ricontattato da Lorenzo Baratti o da suoi assistenti."
  },
  "services": {
    "title": "Servizi - Siti Web per Artigiani e Piccole Aziende",
    "description": "Sei un artigiano o hai una piccola attività? Ti aiuto a costruire la tua presenza online con un sito web su misura, semplice da gestire e ottimizzato per attirare nuovi clienti.",
    "benefits": {
      "title": "Vantaggi",
      "visibility": "Aumenta la tua visibilità",
      "visibility1": " su Google e sui social",
      "professional": "Dà un’immagine professionale",
      "professional1": " al tuo lavoro",
      "contact": "Facilita il contatto con nuovi clienti tramite moduli e chat",
      "contact1": " tramite moduli e chat",
      "responsive": "Funziona su tutti i dispositivi (mobile, tablet, PC)",
      "responsive1": " (mobile, tablet, PC)"
    },
    "packages": {
      "title": "Pacchetti e Prezzi",
      "basic": {
        "title": "Pacchetto Base",
        "price": "300€",
        "features": {
          "1": "Sito vetrina (Home, Chi Siamo, Contatti)",
          "2": "Design responsive (adattabile a smartphone e tablet)",
          "3": "Modulo di contatto",
          "4": "Ottimizzazione SEO base",
          "5": "Tempi di realizzazione: 1-2 settimane"
        }
      },
      "advanced": {
        "title": "Pacchetto Avanzato",
        "price": "600€",
        "features": {
          "1": "Tutto il pacchetto base +",
          "2": "Blog o catalogo prodotti",
          "3": "Integrazione con Firebase per gestione dati",
          "4": "Miglioramenti SEO e velocità",
          "5": "Tempi di realizzazione: 2-4 settimane"
        }
      }
    }
  }
}
